import type { CourseContent } from "../features/courses/genetics/types/types";
import peaImage from "./images/A1.avif";

export const courseContent: CourseContent[] = [
    {
        type: "material",
        activeNavbarTitles: [0, 1],
        secondaryTitle: "碗豆-種皮形狀",
        content: {
            image: peaImage,
            description:
                "古典遺傳學強調基因型可直接決定表現型，基因在古典遺傳是一個抽象概念。認為顯性基因會表現在個體表徵，若一個體中顯性和隱性基因同時存在，則此隱性基因不會表現。豌豆種皮由一對基因控制，R代表顯性基因，r代表隱性基因。若豌豆具有R基因，則種皮形狀為平滑；若控制豌豆種皮形狀的一對基因均為r，則種皮形狀為皺皮。若R和r同時存在，則隱性性狀不會表現，只有顯性性狀會表現，種皮呈現平滑。",
            questionSections: [
                {
                    title: "問題 1",
                    questionContent: {
                        id: "q-material-1",
                        type: "CHOICE",
                        content: "豌豆種皮形狀由幾對基因控制？",
                        options: ["一對", "兩對", "三對", "四對"],
                    },
                },
                {
                    title: "問題 2",
                    questionContent: {
                        id: "q-material-2",
                        type: "CHOICE",
                        content: "R基因代表什麼？",
                        options: [
                            "隱性基因",
                            "顯性基因",
                            "中性基因",
                            "突變基因",
                        ],
                    },
                },
                {
                    title: "問題 3",
                    questionContent: {
                        id: "q-material-3",
                        type: "CHOICE",
                        content: "r基因代表什麼？",
                        options: [
                            "隱性基因",
                            "顯性基因",
                            "中性基因",
                            "突變基因",
                        ],
                    },
                },
            ],
        },
    },
    {
        type: "questions",
        activeNavbarTitles: [0, 1],
        secondaryTitle: "整合問題",
        content: {
            columns: [
                {
                    label: "古典遺傳學",
                    questions: [
                        {
                            id: "q-question-1",
                            type: "CHOICE",
                            content:
                                "古典遺傳學中，基因型與表現型的關係是什麼？",
                            options: [
                                "基因型直接決定表現型",
                                "表現型直接決定基因型",
                                "基因型和表現型無關",
                                "基因型和表現型相互影響",
                            ],
                        },
                        {
                            id: "q-question-2",
                            type: "CHOICE",
                            content:
                                "在古典遺傳學中，顯性基因和隱性基因的關係是什麼？",
                            options: [
                                "顯性基因總是表現在個體表徵上",
                                "隱性基因總是表現在個體表徵上",
                                "顯性和隱性基因同時表現在個體表徵上",
                                "顯性和隱性基因的表達沒有規律",
                            ],
                        },
                    ],
                },
                {
                    label: "分子遺傳學",
                    questions: [
                        {
                            id: "q-question-3",
                            type: "CHOICE",
                            content: "分子遺傳學中，基因與性狀的關係是什麼？",
                            options: [
                                "基因直接決定性狀",
                                "性狀直接決定基因",
                                "基因和性狀無關",
                                "基因和性狀相互影響",
                            ],
                        },
                        {
                            id: "q-question-4",
                            type: "CHOICE",
                            content: "在分子遺傳學中，基因表達的過程是什麼？",
                            options: [
                                "轉錄→轉譯",
                                "轉譯→轉錄",
                                "轉錄→DNA複製",
                                "DNA複製→轉錄",
                            ],
                        },
                    ],
                },
            ],
        },
    },
    {
        type: "overview",
        activeNavbarTitles: [],
        secondaryTitle: "整合",
        content: {
            header: ["", "古典遺傳學", "分子遺傳學"],
            content: [
                [
                    "基因位置",
                    "不清楚基因的位置",
                    "決定一性狀的一對基因分別位於同一對染色體的相對位置上。故稱之為等位基因。生物細胞內的染色體成雙成對。每種生物有一定的染色體數目，而每一對染色體上有許多對等位基因。",
                ],

                [
                    "基因與性狀關係",
                    "一個性狀由一對遺傳因子(等位基因)控制。",
                    "基因經過轉錄、轉譯產生蛋白質，經過蛋白質的作用，而影響性狀。",
                ],

                [
                    "基因的分類(顯隱律)",
                    "決定一性狀的等位基因依照其對性狀的影響不同，分成兩種：顯性和隱性。當顯性基因與隱性基因組合在一起時，會表現出顯性基因的表徵。",
                    "並不將基因分類，因為從分子遺傳學角度，所有基因都可以轉錄轉譯。只是當基因的序列不同的時候，蛋白質構造亦隨之改變，可能造成蛋白質的功能不同，因此性狀也隨之改變。",
                ],
                [
                    "一對等位基因分配至配子的機制",
                    "決定一性狀的等位基因在形成配子時，會分離到不同配子。受精後，受精卵中的等位基因恢復成對。",
                    "產生配子時，染色體會先複製，再分裂兩次，此過程同源染色體分離至不同配子中。決定一性狀的等位基因在形成配子時，會隨染色體分離到不同配子。受精後，受精卵中的染色體恢復成對，其上的等位基因亦恢復成對。",
                ],

                [
                    "兩對等位基因分配至配子的機制",
                    "中間型遺傳共顯性",
                    "若兩等位基因位在同一對染色體，則兩等位基因憶起隨此染色體分離至不同配子中。但有機會發生互換，則配子基因型會有不同組合及比例。若兩等位基因位在不同對染色體，基因隨染色體分配到不同配子中，兩對等位基因形成配子的過程為兩個獨立事件，互不影響。",
                ],

                [
                    "決定兩性狀的兩對等位基因，形成配子的過程為兩個獨立事件，互不影響。",
                    "違反顯隱律，修正某些狀快下，當顯性基因與隱性基因組合在一起時，會表現出中間型的表徵。在另一些狀況下，則兩者皆表現。",
                    "皆可以使用上面轉錄轉譯的機制說明。中間型遺傳是因為顯性基因轉錄轉譯出有功能的蛋白質，而隱性基因轉錄轉譯出無功能的蛋白質，因此表現量只有一半。共顯性則是兩種基因皆表現，但表現出不同的蛋白質，所以性狀兩者皆顯現出來。",
                ],
            ],
        },
        styling: {
            titleColumn: true,
            ratio: [1, 2, 2],
        },
    },
];
